Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.2.35/samg54/atdf/ATSAMG54N19.atdf
<?xml version="1.0"?>
<!--
 Copyright (c) 2017 Microchip Technology Inc.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="4.4" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <file timestamp="2019-12-16T04:50:13Z"/>
  <variants xmlns:mhc="http://www.atmel.com/schemas/avr-tools-device-file/mhc">
    <variant ordercode="ATSAMG54N19-AU" package="LQFP100" pinout="LQFP100" speedmax="96000000" tempmax="+105" tempmin="-40" vccmax="3.6" vccmin="1.62"/>
  </variants>
  <devices>
    <device architecture="CORTEX-M4" family="SAMG" name="ATSAMG54N19" series="SAMG54">
      <address-spaces>
        <address-space id="base" name="base" endianness="little" size="0x100000000" start="0">
          <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io"/>
          <memory-segment name="SYSTEM" start="0xE0000000" size="0x10000000" type="io"/>
          <memory-segment name="IFLASH" start="0x00400000" size="0x00080000" type="flash" pagesize="512"/>
          <memory-segment name="IROM" start="0x00800000" size="0x00400000" type="rom"/>
          <memory-segment name="IRAM" start="0x20000000" size="0x00018000" type="ram"/>
        </address-space>
        <address-space id="fuses" name="fuses" endianness="little" size="1" start="0"/>
        <address-space id="lockbits" name="lockbits" endianness="little" size="0x8" start="0"/>
      </address-spaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x05B3C03F"/>
          <property name="CHIPID_CIDR" value="0x247E0AEA"/>
          <property name="CHIPID_EXID" value="0x0"/>
        </property-group>
        <property-group name="ELECTRICAL_CHARACTERISTICS">
          <property name="CHIP_FREQ_SLCK_RC_MIN" value="20000"/>
          <property name="CHIP_FREQ_SLCK_RC" value="32000" caption="Typical Slow Clock Internal RC frequency"/>
          <property name="CHIP_FREQ_SLCK_RC_MAX" value="44000"/>
          <property name="CHIP_FREQ_MAINCK_RC_8MHZ" value="8000000"/>
          <property name="CHIP_FREQ_MAINCK_RC_16MHZ" value="16000000"/>
          <property name="CHIP_FREQ_MAINCK_RC_24MHZ" value="24000000"/>
          <property name="CHIP_FREQ_CPU_MAX" value="96000000"/>
          <property name="CHIP_FREQ_XTAL_32K" value="32768"/>
          <property name="CHIP_FLASH_WRITE_WAIT_STATE" value="7" caption="Embedded Flash Write Wait State"/>
          <property name="CHIP_FREQ_FWS_0" value="12500000" caption="Maximum operating frequency when FWS is 0"/>
          <property name="CHIP_FREQ_FWS_1" value="25000000" caption="Maximum operating frequency when FWS is 1"/>
          <property name="CHIP_FREQ_FWS_2" value="38000000" caption="Maximum operating frequency when FWS is 2"/>
          <property name="CHIP_FREQ_FWS_3" value="51000000" caption="Maximum operating frequency when FWS is 3"/>
          <property name="CHIP_FREQ_FWS_4" value="64000000" caption="Maximum operating frequency when FWS is 4"/>
          <property name="CHIP_FREQ_FWS_5" value="76000000" caption="Maximum operating frequency when FWS is 5"/>
          <property name="CHIP_FREQ_FWS_6" value="88000000" caption="Maximum operating frequency when FWS is 6"/>
          <property name="CHIP_FREQ_FWS_7" value="96000000" caption="Maximum operating frequency when FWS is 7"/>
          <property name="CHIP_FREQ_FWS_NUMBER" value="8" caption="Number of FWS ranges"/>
        </property-group>
      </property-groups>
      <parameters>
        <param name="__CM4_REV" value="0x0001" caption="CM4 Core Revision"/>
        <param name="__NVIC_PRIO_BITS" value="4" caption="Number of Bits used for Priority Levels"/>
        <param name="__Vendor_SysTickConfig" value="0" caption="Set to 1 if different SysTick Config is used"/>
        <param name="__MPU_PRESENT" value="1" caption="MPU present or not"/>
        <param name="__VTOR_PRESENT" value="1" caption="Vector Table Offset Register present or not"/>
        <param name="__FPU_PRESENT" value="1" caption="FPU present or not"/>
        <param name="LITTLE_ENDIAN" value="1"/>
        <param name="__ARCH_ARM" value="1"/>
        <param name="__ARCH_ARM_CORTEX_M" value="1"/>
        <param name="__DEVICE_IS_SAM" value="1"/>
      </parameters>
      <peripherals>
        <module name="ADC" id="6489" version="Z">
          <instance name="ADC">
            <register-group address-space="base" name="ADC" name-in-module="ADC" offset="0x40038000"/>
            <signals>
              <signal pad="PA8" function="B" group="ADTRG"/>
              <signal pad="PA17" function="X1" group="AD" index="0"/>
              <signal pad="PA18" function="X1" group="AD" index="1"/>
              <signal pad="PA19" function="X1" group="AD" index="2"/>
              <signal pad="PA20" function="X1" group="AD" index="3"/>
              <signal pad="PB0" function="X1" group="AD" index="4"/>
              <signal pad="PB1" function="X1" group="AD" index="5"/>
              <signal pad="PB2" function="X1" group="AD" index="6"/>
              <signal pad="PB2" function="X1" group="WKUP" index="12"/>
              <signal pad="PB3" function="X1" group="AD" index="7"/>
              <signal pad="PB3" function="X1" group="WKUP" index="13"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="1"/>
              <param name="INSTANCE_ID" value="29"/>
              <param name="CLOCK_ID" value="29"/>
              <param name="TRGSEL_ADC_TRIG0" value="0x0" caption="External ADC Trigger Input (ADTRG pin)"/>
              <param name="TRGSEL_ADC_TRIG1" value="0x1" caption="TC0 Channel 0 Output (TIOA0)"/>
              <param name="TRGSEL_ADC_TRIG2" value="0x2" caption="TC0 Channel 1 Output (TIOA1)"/>
              <param name="TRGSEL_ADC_TRIG3" value="0x3" caption="TC0 Channel 2 Output (TIOA2)"/>
              <param name="TRGSEL_ADC_TRIG4" value="0x4" caption="RTCOUT0"/>
              <param name="TRGSEL_ADC_TRIG5" value="0x5" caption="RTTINC"/>
              <param name="SRCCLK_PERIPH_CLK" value="0x0" caption="MCK"/>
            </parameters>
          </instance>
        </module>
        <module name="CHIPID" id="6417" version="Z">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0x400E0740"/>
