Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.2.35/samg54/atdf/ATSAMG54N19.atdf
        <module name="TWIHS" id="11210" version="O">
          <instance name="TWI0">
            <register-group address-space="base" name="TWI0" name-in-module="TWIHS" offset="0x40018000"/>
            <signals>
              <signal pad="PA4" function="A" group="TWCK" index="0"/>
              <signal pad="PA3" function="A" group="TWD" index="0"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="0"/>
              <param name="DMAC_ID_TX" value="16"/>
              <param name="INSTANCE_ID" value="19"/>
              <param name="CLOCK_ID" value="19"/>
            </parameters>
          </instance>
        </module>
        <module name="UART" id="6418" version="N">
          <instance name="UART0">
            <register-group address-space="base" name="UART0" name-in-module="UART" offset="0x400E0600"/>
            <signals>
              <signal pad="PA9" function="A" group="URXD" index="0"/>
              <signal pad="PA10" function="A" group="UTXD" index="0"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="10"/>
              <param name="DMAC_ID_TX" value="23"/>
              <param name="INSTANCE_ID" value="8"/>
              <param name="CLOCK_ID" value="8"/>
            </parameters>
          </instance>
          <instance name="UART1">
            <register-group address-space="base" name="UART1" name-in-module="UART" offset="0x400E0800"/>
            <signals>
              <signal pad="PB2" function="A" group="URXD" index="1"/>
              <signal pad="PB3" function="A" group="UTXD" index="1"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="9"/>
              <param name="DMAC_ID_TX" value="22"/>
              <param name="INSTANCE_ID" value="9"/>
              <param name="CLOCK_ID" value="9"/>
            </parameters>
          </instance>
        </module>
        <module name="USART" id="6089" version="ZN">
          <instance name="USART">
            <register-group address-space="base" name="USART" name-in-module="USART" offset="0x40024000"/>
            <signals>
              <signal pad="PA16" function="A" group="CTS"/>
              <signal pad="PA15" function="A" group="RTS"/>
              <signal pad="PA5" function="A" group="RXD"/>
              <signal pad="PA15" function="B" group="SCK"/>
              <signal pad="PA6" function="A" group="TXD"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="8"/>
              <param name="DMAC_ID_TX" value="21"/>
              <param name="INSTANCE_ID" value="14"/>
              <param name="CLOCK_ID" value="14"/>
              <param name="USCLKS_MCK" value="0" caption="MCK"/>
              <param name="USCLKS_DIV" value="1" caption="MCK/8"/>
              <param name="USCLKS_SCK" value="3" caption="SCK"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="6080" version="H">
          <instance name="WDT">
            <register-group address-space="base" name="WDT" name-in-module="WDT" offset="0x400E1450"/>
            <parameters>
              <param name="INSTANCE_ID" value="4"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="1" version="1">
          <instance name="FUSES">
            <register-group address-space="fuses" name="GPNVMBITS" name-in-module="GPNVMBITS" offset="0"/>
          </instance>
        </module>
        <module name="LOCKBIT" id="1" version="1">
          <instance name="LOCKBIT">
            <register-group address-space="lockbits" name="LOCKBIT" name-in-module="LOCKBIT" offset="0"/>
          </instance>
        </module>
        <module name="SystemControl">
          <instance name="SystemControl">
            <register-group address-space="base" offset="0xE000E000" name-in-module="SystemControl" name="SystemControl"/>
          </instance>
        </module>
        <module name="SysTick">
          <instance name="SysTick">
            <register-group address-space="base" offset="0xE000E010" name-in-module="SysTick" name="SysTick"/>
          </instance>
        </module>
        <module name="NVIC">
          <instance name="NVIC">
            <register-group address-space="base" offset="0xE000E100" name-in-module="NVIC" name="NVIC"/>
          </instance>
        </module>
        <module name="MPU">
          <instance name="MPU">
            <register-group address-space="base" offset="0xE000ED90" name-in-module="MPU" name="MPU"/>
          </instance>
        </module>
      </peripherals>
      <interrupts xmlns:header="http://www.atmel.com/schemas/avr-tools-device-file/header">
        <interrupt index="-15" name="Reset" caption="Reset Vector, invoked on Power up and warm reset" header:alternate-caption="Reset Vector"/>
        <interrupt index="-14" name="NonMaskableInt" caption="Non maskable Interrupt, cannot be stopped or preempted" header:alternate-caption="Non-maskable Interrupt"/>
        <interrupt index="-13" name="HardFault" caption="Hard Fault, all classes of Fault" header:alternate-caption="Hard Fault"/>
        <interrupt index="-12" name="MemoryManagement" caption="Memory Management, MPU mismatch, including Access Violation and No Match" header:alternate-caption="Memory Management Fault"/>
        <interrupt index="-11" name="BusFault" caption="Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault" header:alternate-caption="Bus Fault"/>
        <interrupt index="-10" name="UsageFault" caption="Usage Fault, i.e. Undef Instruction, Illegal State Transition" header:alternate-caption="Usage Fault"/>
        <interrupt index="-5" name="SVCall" caption="System Service Call via SVC instruction" header:alternate-caption="SuperVisor Call"/>
        <interrupt index="-4" name="DebugMonitor" caption="Debug Monitor" header:alternate-caption="Debug Monitor"/>
        <interrupt index="-2" name="PendSV" caption="Pendable request for system service" header:alternate-caption="Pendable SerVice"/>
        <interrupt index="-1" name="SysTick" caption="System Tick Timer"/>
        <interrupt index="0" module-instance="SUPC" name="SUPC" caption="Supply Controller"/>
        <interrupt index="1" module-instance="RSTC" name="RSTC" caption="Reset Controller"/>
        <interrupt index="2" module-instance="RTC" name="RTC" caption="Real Time Clock"/>
        <interrupt index="3" module-instance="RTT" name="RTT" caption="Real Time Timer"/>
        <interrupt index="4" module-instance="WDT" name="WDT" caption="Watchdog Timer"/>
        <interrupt index="5" module-instance="PMC" name="PMC" caption="Power Management Controller"/>
        <interrupt index="6" module-instance="EFC" name="EFC" caption="Enhanced Flash Controller"/>
        <interrupt index="8" module-instance="UART0" name="UART0" caption="UART 0"/>
        <interrupt index="9" module-instance="UART1" name="UART1" caption="UART 1"/>
        <interrupt index="11" module-instance="PIOA" name="PIOA" caption="Parallel I/O Controller A"/>
        <interrupt index="12" module-instance="PIOB" name="PIOB" caption="Parallel I/O Controller B"/>
        <interrupt index="13" module-instance="PDMIC0" name="PDMIC0" caption="PDM 0"/>
        <interrupt index="14" module-instance="USART" name="USART" caption="USART"/>
        <interrupt index="15" module-instance="MEM2MEM" name="MEM2MEM" caption="MEM2MEM"/>
        <interrupt index="16" module-instance="I2SC0" name="I2SC0" caption="I2SC0"/>
        <interrupt index="17" module-instance="I2SC1" name="I2SC1" caption="I2SC1"/>
        <interrupt index="18" module-instance="PDMIC1" name="PDMIC1" caption="PDM 1"/>
        <interrupt index="19" module-instance="TWI0" name="TWI0" caption="Two Wire Interface 0 HS"/>
        <interrupt index="20" module-instance="TWI1" name="TWI1" caption="Two Wire Interface 1"/>
        <interrupt index="21" module-instance="SPI" name="SPI" caption="Serial Peripheral Interface"/>
        <interrupt index="22" module-instance="TWI2" name="TWI2" caption="Two Wire Interface 2"/>
        <interrupt index="23" module-instance="TC0" name="TC0" header:alternate-name="TC0_CH0" caption="Timer/Counter 0" header:alternate-caption="Timer/Counter 0 Channel 0"/>
        <interrupt index="24" module-instance="TC0" name="TC1" header:alternate-name="TC0_CH1" caption="Timer/Counter 1" header:alternate-caption="Timer/Counter 0 Channel 1"/>
        <interrupt index="25" module-instance="TC0" name="TC2" header:alternate-name="TC0_CH2" caption="Timer/Counter 2" header:alternate-caption="Timer/Counter 0 Channel 2"/>
        <interrupt index="26" module-instance="TC1" name="TC3" header:alternate-name="TC1_CH0" caption="Timer/Counter 3" header:alternate-caption="Timer/Counter 1 Channel 0"/>
        <interrupt index="27" module-instance="TC1" name="TC4" header:alternate-name="TC1_CH1" caption="Timer/Counter 4" header:alternate-caption="Timer/Counter 1 Channel 1"/>
        <interrupt index="28" module-instance="TC1" name="TC5" header:alternate-name="TC1_CH2" caption="Timer/Counter 5" header:alternate-caption="Timer/Counter 1 Channel 2"/>
        <interrupt index="29" module-instance="ADC" name="ADC" caption="Analog To Digital Converter"/>
      </interrupts>
      <interfaces>
        <interface type="samjtag" name="JTAG"/>
        <interface type="swd" name="SWD"/>
      </interfaces>
    </device>
  </devices>
  <modules>
    <module name="ADC" caption="Analog-to-Digital Converter" id="6489" version="Z">
      <register-group name="ADC">
        <register caption="Control Register" name="ADC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
          <bitfield caption="Start Conversion" mask="0x00000002" name="START"/>
          <bitfield caption="Automatic Calibration of ADC" mask="0x00000008" name="AUTOCAL"/>
          <bitfield caption="Comparison Restart" mask="0x00000010" name="CMPRST"/>
        </register>
        <register caption="Mode Register" name="ADC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Trigger Enable" mask="0x00000001" name="TRGEN" values="ADC_MR__TRGEN"/>
          <bitfield caption="Trigger Selection" mask="0x0000000E" name="TRGSEL" values="ADC_MR__TRGSEL"/>
          <bitfield caption="Resolution" mask="0x00000010" name="LOWRES" values="ADC_MR__LOWRES"/>
          <bitfield caption="Sleep Mode" mask="0x00000020" name="SLEEP" values="ADC_MR__SLEEP"/>
          <bitfield caption="Free Run Mode" mask="0x00000080" name="FREERUN" values="ADC_MR__FREERUN"/>
          <bitfield caption="Prescaler Rate Selection" mask="0x0000FF00" name="PRESCAL"/>
          <bitfield caption="Start Up Time" mask="0x000F0000" name="STARTUP" values="ADC_MR__STARTUP"/>
          <bitfield caption="ADC Clock Prescaler Division forced to 1" mask="0x00400000" name="DIV1" values="ADC_MR__DIV1"/>
          <bitfield caption="Tracking Time" mask="0x0F000000" name="TRACKTIM"/>
          <bitfield caption="Transfer Period" mask="0x30000000" name="TRANSFER"/>
          <bitfield caption="ADC Clock Prescaler Division forced to 3" mask="0x40000000" name="DIV3" values="ADC_MR__DIV3"/>
          <bitfield caption="Use Sequence Enable" mask="0x80000000" name="USEQ" values="ADC_MR__USEQ"/>
        </register>
