Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.2.35/samg54/atdf/ATSAMG54N19.atdf
      <value-group caption="" name="CHIPID_CIDR__NVPSIZ">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8 Kbytes" name="_8K" value="0x1"/>
        <value caption="16 Kbytes" name="_16K" value="0x2"/>
        <value caption="32 Kbytes" name="_32K" value="0x3"/>
        <value caption="64 Kbytes" name="_64K" value="0x5"/>
        <value caption="128 Kbytes" name="_128K" value="0x7"/>
        <value caption="160 Kbytes" name="_160K" value="0x8"/>
        <value caption="256 Kbytes" name="_256K" value="0x9"/>
        <value caption="512 Kbytes" name="_512K" value="0xA"/>
        <value caption="1024 Kbytes" name="_1024K" value="0xC"/>
        <value caption="2048 Kbytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__NVPSIZ2">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8 Kbytes" name="_8K" value="0x1"/>
        <value caption="16 Kbytes" name="_16K" value="0x2"/>
        <value caption="32 Kbytes" name="_32K" value="0x3"/>
        <value caption="64 Kbytes" name="_64K" value="0x5"/>
        <value caption="128 Kbytes" name="_128K" value="0x7"/>
        <value caption="256 Kbytes" name="_256K" value="0x9"/>
        <value caption="512 Kbytes" name="_512K" value="0xA"/>
        <value caption="1024 Kbytes" name="_1024K" value="0xC"/>
        <value caption="2048 Kbytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__SRAMSIZ">
        <value caption="48 Kbytes" name="_48K" value="0x0"/>
        <value caption="192 Kbytes" name="_192K" value="0x1"/>
        <value caption="384 Kbytes" name="_384K" value="0x2"/>
        <value caption="6 Kbytes" name="_6K" value="0x3"/>
        <value caption="24 Kbytes" name="_24K" value="0x4"/>
        <value caption="4 Kbytes" name="_4K" value="0x5"/>
        <value caption="80 Kbytes" name="_80K" value="0x6"/>
        <value caption="160 Kbytes" name="_160K" value="0x7"/>
        <value caption="8 Kbytes" name="_8K" value="0x8"/>
        <value caption="16 Kbytes" name="_16K" value="0x9"/>
        <value caption="32 Kbytes" name="_32K" value="0xA"/>
        <value caption="64 Kbytes" name="_64K" value="0xB"/>
        <value caption="128 Kbytes" name="_128K" value="0xC"/>
        <value caption="256 Kbytes" name="_256K" value="0xD"/>
        <value caption="96 Kbytes" name="_96K" value="0xE"/>
        <value caption="512 Kbytes" name="_512K" value="0xF"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__ARCH">
        <value caption="SAM G54" name="SAMG54" value="0x47"/>
      </value-group>
      <value-group caption="" name="CHIPID_CIDR__NVPTYP">
        <value caption="ROM" name="ROM" value="0x0"/>
        <value caption="ROMless or on-chip Flash" name="ROMLESS" value="0x1"/>
        <value caption="Embedded Flash Memory" name="FLASH" value="0x2"/>
        <value caption="ROM and Embedded Flash Memory- NVPSIZ is ROM size- NVPSIZ2 is Flash size" name="ROM_FLASH" value="0x3"/>
        <value caption="SRAM emulating ROM" name="SRAM" value="0x4"/>
      </value-group>
    </module>
    <module name="EFC" caption="Embedded Flash Controller" id="6450" version="T">
      <register-group name="EFC">
        <register caption="EEFC Flash Mode Register" name="EEFC_FMR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Flash Ready Interrupt Enable" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Wait State" mask="0x00000F00" name="FWS"/>
          <bitfield caption="Sequential Code Optimization Disable" mask="0x00010000" name="SCOD"/>
          <bitfield caption="Flash Access Mode" mask="0x01000000" name="FAM"/>
          <bitfield caption="Code Loop Optimization Enable" mask="0x04000000" name="CLOE"/>
        </register>
        <register caption="EEFC Flash Command Register" name="EEFC_FCR" offset="0x04" rw="W" size="4">
          <bitfield caption="Flash Command" mask="0x000000FF" name="FCMD" values="EEFC_FCR__FCMD"/>
          <bitfield caption="Flash Command Argument" mask="0x00FFFF00" name="FARG"/>
          <bitfield caption="Flash Writing Protection Key" mask="0xFF000000" name="FKEY" values="EEFC_FCR__FKEY"/>
        </register>
        <register caption="EEFC Flash Status Register" name="EEFC_FSR" offset="0x08" rw="R" size="4">
          <bitfield caption="Flash Ready Status (cleared when Flash is busy)" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Command Error Status (cleared on read or by writing EEFC_FCR)" mask="0x00000002" name="FCMDE"/>
          <bitfield caption="Flash Lock Error Status (cleared on read)" mask="0x00000004" name="FLOCKE"/>
          <bitfield caption="Flash Error Status (cleared when a programming operation starts)" mask="0x00000008" name="FLERR"/>
        </register>
        <register caption="EEFC Flash Result Register" name="EEFC_FRR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Flash Result Value" mask="0xFFFFFFFF" name="FVALUE"/>
        </register>
      </register-group>
      <value-group caption="" name="EEFC_FCR__FCMD">
        <value caption="Get Flash descriptor" name="GETD" value="0x00"/>
        <value caption="Write page" name="WP" value="0x01"/>
        <value caption="Write page and lock" name="WPL" value="0x02"/>
        <value caption="Erase page and write page" name="EWP" value="0x03"/>
        <value caption="Erase page and write page then lock" name="EWPL" value="0x04"/>
        <value caption="Erase all" name="EA" value="0x05"/>
        <value caption="Erase pages" name="EPA" value="0x07"/>
        <value caption="Set lock bit" name="SLB" value="0x08"/>
        <value caption="Clear lock bit" name="CLB" value="0x09"/>
        <value caption="Get lock bit" name="GLB" value="0x0A"/>
        <value caption="Set GPNVM bit" name="SGPB" value="0x0B"/>
        <value caption="Clear GPNVM bit" name="CGPB" value="0x0C"/>
        <value caption="Get GPNVM bit" name="GGPB" value="0x0D"/>
        <value caption="Start read unique identifier" name="STUI" value="0x0E"/>
        <value caption="Stop read unique identifier" name="SPUI" value="0x0F"/>
        <value caption="Get CALIB bit" name="GCALB" value="0x10"/>
        <value caption="Erase sector" name="ES" value="0x11"/>
        <value caption="Write user signature" name="WUS" value="0x12"/>
        <value caption="Erase user signature" name="EUS" value="0x13"/>
        <value caption="Start read user signature" name="STUS" value="0x14"/>
        <value caption="Stop read user signature" name="SPUS" value="0x15"/>
      </value-group>
