Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.2.35/samg54/atdf/ATSAMG54N19.atdf
        <register caption="Receive Pointer Register" name="I2SC_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="I2SC_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="I2SC_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="I2SC_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="I2SC_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="I2SC_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="I2SC_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="I2SC_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="I2SC_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
        <register caption="Transfer Status Register" name="I2SC_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transfer Bus Error" mask="0x01000000" name="ERR"/>
        </register>
      </register-group>
      <value-group caption="" name="I2SC_MR__MODE">
        <value caption="I2SCK and i2SWS pin inputs used as bit clock and word select/frame synchronization." name="SLAVE" value="0"/>
        <value caption="Bit clock and word select/frame synchronization generated by I2SC from MCK and output to I2SCK and I2SWS pins. MCK is output as master clock on I2SMCK if I2SC_MR.IMCKMODE is set." name="MASTER" value="1"/>
      </value-group>
      <value-group caption="" name="I2SC_MR__DATALENGTH">
        <value caption="Data length is set to 32 bits" name="_32_BITS" value="0x0"/>
        <value caption="Data length is set to 24 bits" name="_24_BITS" value="0x1"/>
        <value caption="Data length is set to 20 bits" name="_20_BITS" value="0x2"/>
        <value caption="Data length is set to 18 bits" name="_18_BITS" value="0x3"/>
        <value caption="Data length is set to 16 bits" name="_16_BITS" value="0x4"/>
        <value caption="Data length is set to 16-bit compact stereo. Left sample in bits 15:0 and right sample in bits 31:16 of same word." name="_16_BITS_COMPACT" value="0x5"/>
        <value caption="Data length is set to 8 bits" name="_8_BITS" value="0x6"/>
        <value caption="Data length is set to 8-bit compact stereo. Left sample in bits 7:0 and right sample in bits 15:8 of the same word." name="_8_BITS_COMPACT" value="0x7"/>
      </value-group>
      <value-group caption="" name="I2SC_MR__IMCKFS">
        <value caption="Sample frequency ratio set to 16" name="M2SF16" value="0x0"/>
        <value caption="Sample frequency ratio set to 32" name="M2SF32" value="0x1"/>
        <value caption="Sample frequency ratio set to 48" name="M2SF48" value="0x2"/>
        <value caption="Sample frequency ratio set to 64" name="M2SF64" value="0x3"/>
        <value caption="Sample frequency ratio set to 96" name="M2SF96" value="0x5"/>
        <value caption="Sample frequency ratio set to 128" name="M2SF128" value="0x7"/>
        <value caption="Sample frequency ratio set to 192" name="M2SF192" value="0xB"/>
        <value caption="Sample frequency ratio set to 256" name="M2SF256" value="0xF"/>
        <value caption="Sample frequency ratio set to 384" name="M2SF384" value="0x17"/>
        <value caption="Sample frequency ratio set to 512" name="M2SF512" value="0x1F"/>
        <value caption="Sample frequency ratio set to 768" name="M2SF768" value="0x2F"/>
        <value caption="Sample frequency ratio set to 1024" name="M2SF1024" value="0x3F"/>
      </value-group>
    </module>
    <module name="MATRIX" caption="AHB Bus Matrix" id="11049" version="E">
      <register-group name="MATRIX">
        <register caption="Master Configuration Register 0" name="MATRIX_MCFG" offset="0x0" rw="RW" size="4" count="3">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT" values="MATRIX_MCFG__ULBT"/>
        </register>
        <register caption="Slave Configuration Register 0" name="MATRIX_SCFG" offset="0x40" rw="RW" size="4" count="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE" values="MATRIX_SCFG__DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
        </register>
