Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.2.35/samg54/atdf/ATSAMG54N19.atdf
        <register caption="Transmit Counter Register" name="MEM2MEM_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="MEM2MEM_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="MEM2MEM_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="MEM2MEM_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="MEM2MEM_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="MEM2MEM_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
        <register caption="Transfer Status Register" name="MEM2MEM_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transfer Bus Error" mask="0x01000000" name="ERR"/>
        </register>
      </register-group>
      <value-group caption="" name="MEM2MEM_MR__TSIZE">
        <value caption="The buffer size is defined in byte." name="T_8BIT" value="0x0"/>
        <value caption="The buffer size is defined in half-word (16-bit)." name="T_16BIT" value="0x1"/>
        <value caption="The buffer size is defined in word (32-bit). Default value." name="T_32BIT" value="0x2"/>
      </value-group>
    </module>
    <module name="PDC" caption="Peripheral DMA Controller" id="6031" version="I">
      <register-group name="PDC">
        <register caption="Receive Pointer Register" name="PERIPH_RPR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="PERIPH_RCR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="PERIPH_TPR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="PERIPH_TCR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="PERIPH_RNPR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="PERIPH_RNCR" offset="0x14" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="PERIPH_TNPR" offset="0x18" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="PERIPH_TNCR" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="PERIPH_PTCR" offset="0x20" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
        <register caption="Transfer Status Register" name="PERIPH_PTSR" offset="0x24" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transfer Bus Error" mask="0x01000000" name="ERR"/>
        </register>
      </register-group>
    </module>
    <module name="PDMIC" caption="Pulse Density Modulation Interface Controller" id="11237" version="D">
      <register-group name="PDMIC">
        <register caption="Control Register" name="PDMIC_CR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
          <bitfield caption="Enable PDM" mask="0x00000010" name="ENPDM"/>
        </register>
        <register caption="Mode Register" name="PDMIC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Prescaler Rate Selection" mask="0x00007F00" name="PRESCAL"/>
        </register>
        <register caption="Converted Data Register" name="PDMIC_CDR" offset="0x14" rw="R" size="4">
          <bitfield caption="Data Converted" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="Interrupt Enable Register" name="PDMIC_IER" offset="0x18" rw="W" size="4" atomic-op="set:PDMIC_IMR">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x01000000" name="DRDY"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x02000000" name="OVRE"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x10000000" name="RXBUFF"/>
        </register>
        <register caption="Interrupt Disable Register" name="PDMIC_IDR" offset="0x1C" rw="W" size="4" atomic-op="clear:PDMIC_IMR">
          <bitfield caption="Data Ready Interrupt Disable" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Disable" mask="0x02000000" name="OVRE"/>
          <bitfield caption="End of Receive Buffer Interrupt Disable" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x10000000" name="RXBUFF"/>
        </register>
        <register caption="Interrupt Mask Register" name="PDMIC_IMR" offset="0x20" rw="R" size="4" atomic-op="read:PDMIC_IMR">
          <bitfield caption="Data Ready Interrupt Mask" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Mask" mask="0x02000000" name="OVRE"/>
          <bitfield caption="End of Receive Buffer Interrupt Mask" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask" mask="0x10000000" name="RXBUFF"/>
        </register>
        <register caption="Interrupt Status Register" name="PDMIC_ISR" offset="0x24" rw="R" size="4" atomic-op="read:PDMIC_ISR">
          <bitfield caption="FIFO Count" mask="0x00FF0000" name="FIFOCNT"/>
          <bitfield caption="Data Ready" mask="0x01000000" name="DRDY"/>
          <bitfield caption="Overrun Error" mask="0x02000000" name="OVRE"/>
          <bitfield caption="End of RX Buffer" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="RX Buffer Full" mask="0x10000000" name="RXBUFF"/>
        </register>
        <register caption="DSP Configuration Register 0" name="PDMIC_DSPR" offset="0x58" rw="RW" size="4" count="2">
          <bitfield caption="High-Pass Filter Bypass" mask="0x00000002" name="HPFBYP"/>
          <bitfield caption="SINCC Filter Bypass" mask="0x00000004" name="SINBYP"/>
          <bitfield caption="Data Size" mask="0x00000008" name="SIZE"/>
          <bitfield caption="Oversampling Ratio" mask="0x00000070" name="OSR" values="PDMIC_DSPR0__OSR"/>
          <bitfield caption="Data Scale" mask="0x00000F00" name="SCALE"/>
          <bitfield caption="Data Shift" mask="0x0000F000" name="SHIFT"/>
        </register>
