Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.2.35/samg54/atdf/ATSAMG54N19.atdf
        <register caption="Transfer Control Register" name="SPI_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
        <register caption="Transfer Status Register" name="SPI_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transfer Bus Error" mask="0x01000000" name="ERR"/>
        </register>
      </register-group>
      <value-group caption="" name="SPI_CSR__BITS">
        <value caption="8 bits for transfer" name="_8_BIT" value="0x0"/>
        <value caption="9 bits for transfer" name="_9_BIT" value="0x1"/>
        <value caption="10 bits for transfer" name="_10_BIT" value="0x2"/>
        <value caption="11 bits for transfer" name="_11_BIT" value="0x3"/>
        <value caption="12 bits for transfer" name="_12_BIT" value="0x4"/>
        <value caption="13 bits for transfer" name="_13_BIT" value="0x5"/>
        <value caption="14 bits for transfer" name="_14_BIT" value="0x6"/>
        <value caption="15 bits for transfer" name="_15_BIT" value="0x7"/>
        <value caption="16 bits for transfer" name="_16_BIT" value="0x8"/>
      </value-group>
      <value-group caption="" name="SPI_MR__MSTR">
        <value caption="Master" name="MASTER" value="0x1"/>
        <value caption="Slave" name="SLAVE" value="0x0"/>
      </value-group>
      <value-group caption="" name="SPI_MR__PCS">
        <value caption="NPCS0 as Chip Select" name="NPCS0" value="0x2"/>
        <value caption="NPCS1 as Chip Select" name="NPCS1" value="0x1"/>
      </value-group>
      <value-group caption="" name="SPI_TDR__PCS">
        <value caption="NPCS0 as Chip Select" name="NPCS0" value="0x2"/>
        <value caption="NPCS1 as Chip Select" name="NPCS1" value="0x1"/>
      </value-group>
      <value-group caption="" name="SPI_CSR__CPOL">
        <value caption="The inactive state value of SPCK is logic level zero" name="IDLE_LOW" value="0x0"/>
        <value caption="The inactive state value of SPCK is logic level one" name="IDLE_HIGH" value="0x1"/>
      </value-group>
      <value-group caption="" name="SPI_CSR__NCPHA">
        <value caption="Data is changed on the leading edge of SPCK and captured on the following edge of SPCK" name="VALID_LEADING_EDGE" value="0x1"/>
        <value caption="Data is captured on the leading edge of SPCK and changed on the following edge of SPCK" name="VALID_TRAILING_EDGE" value="0x0"/>
      </value-group>
      <value-group caption="" name="SPI_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x535049"/>
      </value-group>
    </module>
    <module name="SUPC" caption="Supply Controller" id="11228" version="E">
      <register-group name="SUPC">
        <register caption="Supply Controller Control Register" name="SUPC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="This bit must always be written to 0." mask="0x00000004" name="ZERO"/>
          <bitfield caption="Crystal Oscillator Select" mask="0x00000008" name="XTALSEL" values="SUPC_CR__XTALSEL"/>
          <bitfield caption="Password" mask="0xFF000000" name="KEY" values="SUPC_CR__KEY"/>
        </register>
        <register caption="Supply Controller Supply Monitor Mode Register" name="SUPC_SMMR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Supply Monitor Threshold" mask="0x0000000F" name="SMTH" values="SUPC_SMMR__SMTH"/>
          <bitfield caption="Supply Monitor Sampling Period" mask="0x00000700" name="SMSMPL" values="SUPC_SMMR__SMSMPL"/>
          <bitfield caption="Supply Monitor Reset Enable" mask="0x00001000" name="SMRSTEN" values="SUPC_SMMR__SMRSTEN"/>
          <bitfield caption="Supply Monitor Interrupt Enable" mask="0x00002000" name="SMIEN" values="SUPC_SMMR__SMIEN"/>
        </register>
        <register caption="Supply Controller Mode Register" name="SUPC_MR" offset="0x08" rw="RW" size="4">
          <bitfield caption="VRVDD Field Selection" mask="0x00000100" name="VDDSEL" values="SUPC_MR__VDDSEL"/>
          <bitfield caption="VRVDD Field Selection" mask="0x00000E00" name="VRVDD" values="SUPC_MR__VRVDD"/>
          <bitfield caption="POR Core Reset Enable" mask="0x00001000" name="BODRSTEN" values="SUPC_MR__BODRSTEN"/>
          <bitfield caption="POR Core Disable" mask="0x00002000" name="BODDIS" values="SUPC_MR__BODDIS"/>
          <bitfield caption="Oscillator Bypass" mask="0x00100000" name="OSCBYPASS" values="SUPC_MR__OSCBYPASS"/>
          <bitfield caption="SRAM1 Power Switch" mask="0x00400000" name="PSWITCH1" values="SUPC_MR__PSWITCH1"/>
          <bitfield caption="SRAM2 Power Switch" mask="0x00800000" name="PSWITCH2" values="SUPC_MR__PSWITCH2"/>
          <bitfield caption="Password Key" mask="0xFF000000" name="KEY" values="SUPC_MR__KEY"/>
        </register>
